Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>ipfs</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository_collaborator.this["bifrost-gateway:ameanasad"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "push"
      + permission_diff_suppression = false
      + repository                  = "bifrost-gateway"
      + username                    = "AmeanAsad"
    }

  # github_repository_file.this[".github/.github/workflows/stale.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/workflows/stale.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: Close and mark stale issue
            
            on:
              schedule:
                - cron: '0 0 * * *'
            
            permissions:
              issues: write
              pull-requests: write
            
            jobs:
              stale:
                uses: pl-strflt/.github/.github/workflows/reusable-stale-issue.yml@v0.3
        EOT
      + file                = ".github/workflows/stale.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = ".github"
      + sha                 = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->